VV_cases/V2_thermal/templates/base_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// V2: buoyantPimpleFoam, 2-D heated channel, Re=5-40 (steady-state regime)
// Run as transient until steady state (Cl(t) -> const, Nu(t) -> const).

application     buoyantPimpleFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         60;             // long enough to reach steady state at Re=5-40

deltaT          1e-3;           // larger dt ok at low Re (Co << 1)
adjustTimeStep  no;
maxCo           0.5;

writeControl    runTime;
writeInterval   1.0;            // 1 write/s; reduce to 5.0 for low-Re runs

purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        executeControl  timeStep;
        writeControl    timeStep;
        writeInterval   1;
        log             yes;

        patches         (cylinder);
        rho             rho;            // use computed density (compressible)
        CofR            (0 0 0);
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         0.01263;        // change per Re (Re10 default)
        lRef            0.012;
        Aref            0.000120;       // D * z-span = 0.012 * 0.010
    }

    wallHeatFlux_cylinder
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        executeControl  timeStep;
        writeControl    timeStep;
        writeInterval   1;
        patches         (cylinder);
        qr              none;
    }

    residuals
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (U p_rgh T);
        writeControl    timeStep;
        writeInterval   1;
    }
}
