VV_cases/V2_thermal/templates/base_case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ============================================================
// V2 — 2-D channel, blockage beta = D/H = 0.25
// Replicates Dhiman et al. (2005/2007) for Nu verification.
//
// D = 0.012 m  =>  H = D/beta = 0.048 m  (no-slip walls top AND bottom)
// L_in = 8D = 0.096 m,  L_out = 20D = 0.240 m
// z-span: 0.010 m, 1 cell  (empty BC => 2-D)
// Run at Re = 5, 10, 20, 40 (steady-state flow, low Re)
//
// Background cell size ~ 2 mm  =>  168 x 24 x 1
// ============================================================

scale 1;

vertices
(
    (-0.096 -0.024 -0.005)   // 0
    ( 0.240 -0.024 -0.005)   // 1
    ( 0.240  0.024 -0.005)   // 2
    (-0.096  0.024 -0.005)   // 3
    (-0.096 -0.024  0.005)   // 4
    ( 0.240 -0.024  0.005)   // 5
    ( 0.240  0.024  0.005)   // 6
    (-0.096  0.024  0.005)   // 7
);

blocks
(
    // 168 x 24 x 1  (dx ~ 2 mm, dy = 2 mm, dz = 10 mm)
    hex (0 1 2 3 4 5 6 7) (168 24 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type patch;
        faces ( (1 2 6 5) );
    }
    bottom
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    top
    {
        type wall;
        faces ( (3 7 6 2) );
    }
    front
    {
        type empty;
        faces ( (0 3 2 1) );
    }
    back
    {
        type empty;
        faces ( (4 5 6 7) );
    }
);

mergePatchPairs ();
