VV_cases/V2_thermal/templates/base_case/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// ============================================================
// snappyHexMeshDict for 2-D benchmark cases V1 / V2
// (no-slip top/bottom walls, beta = 0.5 or 0.25)
//
// Cylinder: D = 0.012 m, centre (0, 0, 0)
// BL layers on cylinder AND channel walls (top/bottom).
//
// For V3/V4a (symmetry top/bottom): copy this file but remove
// the "top" and "bottom" entries from addLayersControls.layers.
// ============================================================

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    cylinder
    {
        type    searchableCylinder;
        point1  (0  0  -0.010);
        point2  (0  0   0.010);
        radius  0.006;
    }

    nearCylinder
    {
        type searchableBox;
        min (-0.024 -0.018 -0.010);
        max ( 0.072  0.018  0.010);
    }

    wakeBox
    {
        type searchableBox;
        min ( 0.000 -0.018 -0.010);
        max ( 0.180  0.018  0.010);
    }
}

castellatedMeshControls
{
    maxLocalCells           500000;
    maxGlobalCells          2000000;
    minRefinementCells      0;
    maxLoadUnbalance        0.10;
    nCellsBetweenLevels     3;
    resolveFeatureAngle     30;

    features ();

    refinementSurfaces
    {
        cylinder
        {
            level   (4 4);          // base 2mm -> 2mm/16 = 0.125 mm at level 4
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        nearCylinder
        {
            mode    inside;
            levels  ((1e15 3));     // level 3 -> 0.25 mm near cylinder
        }
        wakeBox
        {
            mode    inside;
            levels  ((1e15 2));     // level 2 -> 0.5 mm in wake
        }
    }

    locationInMesh (-0.090 0 0);    // point inside mesh, upstream of cylinder
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        5;
    tolerance           2.0;
    nSolveIter          100;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.3;
    minThickness        0.01;
    nGrow               0;
    featureAngle        60;
    nRelaxIter          3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
    nRelaxedIter        20;

    layers
    {
        cylinder
        {
            nSurfaceLayers  8;      // 8 BL layers on cylinder
        }
        // For V1/V2 only: BL on channel walls too.
        // Remove the next two entries for V3/V4a (symmetry walls).
        top
        {
            nSurfaceLayers  4;
        }
        bottom
        {
            nSurfaceLayers  4;
        }
    }
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness  4;
    maxConcave           80;
    minVol               1e-13;
    minTetQuality        1e-30;
    minArea             -1;
    minTwist             0.02;
    minDeterminant       0.001;
    minFaceWeight        0.02;
    minVolRatio          0.01;
    minTriangleTwist    -1;
    nSmoothScale         4;
    errorReduction       0.75;

    relaxed
    {
        maxNonOrtho     75;
    }
}

writeFlags ( scalarLevels layerSets );
mergeTolerance 1e-6;
