VV_cases/V2_thermal/templates/base_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// V2: buoyantPimpleFoam, 2-D heated channel, beta=0.25, no-slip walls
// Run at Re = 5, 10, 20, 40 (steady/unsteady regime for Nu validation)
// U values: Re5=0.00632, Re10=0.01263, Re20=0.02527, Re40=0.05053, Re100=0.1263 m/s

dimensions      [0 1 -1 0 0 0 0];

// *** Set internalField and inlet fixedValue to match chosen Re ***
internalField   uniform (0.01263 0 0);  // Re=10 default; change for each run

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform (0.01263 0 0);  // change with Re
    }
    outlet
    {
        type        zeroGradient;
    }
    top
    {
        type        noSlip;
    }
    bottom
    {
        type        noSlip;
    }
    cylinder
    {
        type        noSlip;
    }
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}
