VV_cases/V2_thermal/templates/base_case/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// V2/V4a/V4b: buoyantPimpleFoam
// p_rgh = p - rho*g.h   (with g=0  =>  p_rgh = p exactly)
// Using gauge pressure (zero reference at outlet).
// fixedFluxPressure on walls ensures dp/dn = -rho*(g.n) = 0 when g=0.

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet
    {
        type        fixedFluxPressure;
        value       uniform 0;
    }
    outlet
    {
        type        fixedValue;
        value       uniform 0;
    }
    top
    {
        type        fixedFluxPressure;
        value       uniform 0;
    }
    bottom
    {
        type        fixedFluxPressure;
        value       uniform 0;
    }
    cylinder
    {
        type        fixedFluxPressure;
        value       uniform 0;
    }
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}
