VV_cases/V2_thermal/templates/base_case/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// V2: 2-D heated cylinder in channel
// T_in = 293.15 K (20 C),  T_w = 343.15 K (70 C),  dT = 50 K

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 293.15;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform 293.15;
    }
    outlet
    {
        // inletOutlet: zeroGradient on outflow, fixedValue on reverse flow
        type        inletOutlet;
        inletValue  uniform 293.15;
        value       uniform 293.15;
    }
    top
    {
        // Adiabatic channel wall for benchmark (Dhiman: insulated walls)
        type        zeroGradient;
    }
    bottom
    {
        type        zeroGradient;
    }
    cylinder
    {
        type        fixedValue;
        value       uniform 343.15;
    }
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}
